{"meta":{"title":"隐贞Blog","subtitle":null,"description":"南方二月明媚天~如果心情是有颜色的，那么一定是春草发芽的嫩绿色。关注iOS领域，正打算往游戏、动漫方向发展。","author":"隐贞","url":"http://yinzhen.tech"},"pages":[{"title":"风雨日记","date":"2017-03-15T03:04:48.000Z","updated":"2017-03-15T08:26:52.000Z","comments":true,"path":"dailyLife/index.html","permalink":"http://yinzhen.tech/dailyLife/index.html","excerpt":"","text":""},{"title":"iOSCategory","date":"2017-03-15T08:32:17.000Z","updated":"2017-03-15T08:43:09.000Z","comments":true,"path":"iOSCategory/index.html","permalink":"http://yinzhen.tech/iOSCategory/index.html","excerpt":"","text":""},{"title":"如果可以酿成一首诗","date":"2017-03-15T03:05:43.000Z","updated":"2017-03-15T08:26:51.000Z","comments":true,"path":"onePoem/index.html","permalink":"http://yinzhen.tech/onePoem/index.html","excerpt":"","text":""},{"title":"tags","date":"2017-03-15T07:44:42.000Z","updated":"2017-03-15T07:45:21.000Z","comments":true,"path":"tags/index.html","permalink":"http://yinzhen.tech/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"test","slug":"test","date":"2017-03-15T08:40:43.000Z","updated":"2017-03-15T08:41:54.000Z","comments":true,"path":"2017/03/15/test/","link":"","permalink":"http://yinzhen.tech/2017/03/15/test/","excerpt":"","text":"TEST","categories":[{"name":"iOS技术栈","slug":"iOS技术栈","permalink":"http://yinzhen.tech/categories/iOS技术栈/"}],"tags":[]},{"title":"Blog诞生日","slug":"Blog诞生日","date":"2017-02-17T05:10:43.000Z","updated":"2017-03-14T06:54:58.000Z","comments":true,"path":"2017/02/17/Blog诞生日/","link":"","permalink":"http://yinzhen.tech/2017/02/17/Blog诞生日/","excerpt":"","text":"缘起 自从小时候接触互联网，就一直希望拥有自己的个人主站。然而时间过去了那么久，曾经的愿望也忘得一干二净，忽然的前几天又萌生出建站的念头。于是乎，搜索教程、购买域名、搭建网站、部署服务，虽然作为新手有很多地方磕磕碰碰，但这也是Geek的乐趣之一吧~ 大学毕业之前一直都有写些文学相关的东西、心灵的笔录，在别人言语之间多以文艺青年形象自居。然而毕业之后，话语越来越少，逐渐沉默转而变成一个IT编程奋斗男。工作的压力是往常北漂人民所能感受到的，在要求自立自强自学的同时似乎每日的时间都被挤弄得一滴不剩。趁着在离职公司的这段时间好好自我省视，也把相关的技能补充加强，规划将来的方向。 兴趣 兴趣爱好之多，以至于我好像没有不感兴趣的。现在能做到保持有的兴趣主要有：科技、手工、烹饪、旅游、动漫、音乐、歌剧、文学、RPG，我几乎都想要在以上领域有所交叉接触。 不过现在方向是往科技偏移，毕竟科技能够明显推动对社会的进步。虽然还不是领跑科技界的人，不过相关知识和经验的积累，对于我这种处于平凡的生活环境中的人是必不可少的过程。","categories":[{"name":"风雨日记","slug":"风雨日记","permalink":"http://yinzhen.tech/categories/风雨日记/"}],"tags":[{"name":"毕业","slug":"毕业","permalink":"http://yinzhen.tech/tags/毕业/"},{"name":"人生规划","slug":"人生规划","permalink":"http://yinzhen.tech/tags/人生规划/"},{"name":"兴趣","slug":"兴趣","permalink":"http://yinzhen.tech/tags/兴趣/"}]},{"title":"入夏前小计","slug":"入夏前小计","date":"2016-05-02T10:02:41.000Z","updated":"2017-03-14T07:17:10.000Z","comments":true,"path":"2016/05/02/入夏前小计/","link":"","permalink":"http://yinzhen.tech/2016/05/02/入夏前小计/","excerpt":"","text":"​ 从学校毕业出来后也将近一年了，一年。​ 无论是在职场上拼搏还是在学业上奋斗、亦或是正在待业的人们，这段时间，“经历”成为了大家最主要的财富，并不是需要怎么样刻苦铭心的挑战，而是在这段时间你更看清了自己、了解了自己。毕业前，我选择了去进修互联网行业是因为意识到自己在本专业并没有太多的能力体现，并且也不想顺着父母的意思去考公务员或进入一些关系网的国企，觉得自己本该是潇洒的自由人，可以来去匆匆。不过怎么做梦都没想到要在帝都北漂~~之前觉得“北漂”一词离我还好远好远，而且北漂的历程也不是一帆风顺，感谢远在海角的家人帮我度过艰难的时刻，也感谢周围朋友的帮助。 ​ 北漂，是从毕业半年前开始，一年了。​ 2015年1月，从学校踏上去往帝都的列车，放弃了寒假暑假那些四处游行的快乐，进入了一个半封闭式的学习环境。就像要怀抱青春与梦想那样，我要拼搏奋斗，I want to be famous and rich~ 在机构里热火朝天地学习四个月有余，住的宿舍认识了几个小伙伴。一开始，头天上午抵达目的地但在住的地方折腾了不少时间找合适的下榻，当晚在同兴发宾馆遇见了同宿舍的小伙伴“小高”，不久后小高带来了另一个小伙伴“樊 * ”，然后有天小高发现住在隔壁的舍友是同校同学“成哥”和“小军”，好吧~我就和这一群小伙伴在艰苦的岁月里建立起了革命友谊(●’◡’●)。机构的那段日子可真是没白天黑夜地学习，大家常常互相讨论着技术的心得还有难点，和高考前夕一阵瘙痒的时光一样，努力、努力。很快四个月的时间要过去，机构要把这一批的人员清理出去，总感觉自己还需要更多的学习，要让我独立去完成一些项目还是欠缺太多的能力，这几个月的学习也就只能是摸着门框而已。​ 2015年5月初，我们在找工作之前接了一项私活（要求通过蓝牙技术来控制外接设备的工作模式，以及统计用户的使用频率）。现在看起来其实难度并没有多大，只是这一步的实践是那个时候我们将理论的demon变成更为具体的工程。首先遇到的问题就是客户端设备的网络请求（主要是请求头的配置，按照老板的特定方式进行信息的加密）~老板“张先生”当时还在百度上班，只有周末的时候工作室才开放，我们四个人只有一台开发用的电脑，所以很难施展得开来。在学校的时候并没有接触过网络编程这一领域，而在培训机构也只是简单的get、post请求，并没有深入到加密算法。老板交流了多次，在他的帮助下我把网络模块部分暂时完成，如果没有太多的更改和算法的改变，我觉得自己封装得挺好的。之后我把其它模块的任务交给了其他小伙伴，还是希望工作职责一定要分明，并且要有责任感。可惜的是我网络封装的部分被其他开发成员破坏了结构，因为多次向老板确认最新的接口文档而被老板觉得厌烦就提前结束了我的开发任务。虽然结局并不是那么地理想，但是还是感谢在这一期间我能接触到加密算法、网络信息安全这一类的概念。​ 2015年5月底，这一天我和另外一个小伙伴小军共同来到了上家公司“北京酷博灵科”，原先自己有更好的打算，并不想在这家公司作为初级工程师的实习身份。不过母亲的一些劝告，以及确实认识到自己能力限制，就在这家公司干活了。进入公司我被分配到了公司的产品部，小军则被分配到项目部，命运这东西说好也不说太好。我在这家公司进来的时候产品已经是一个比较完善的项目了，所以没有前期开发的那种幸苦，转而是做后期的维护和重构以及一些需求开发、版本迭代。公司开发的一款产品是名为“圆圆”的O2O平台服务，不过资金有限而且大部分O2O产品都在这一期间与真实市场对撞，结果是大部分的产品、项目都进入 无限的死循环，头破血流而亡。所以在公司已经工作四个月有余，领着最低的工资，拿着最不靠谱拖时的工资，最心酸的是当时公司还未进入破产模式，提前把公司里半数的人给“强制主动辞职”，并且每个人都有不同分量的被拖欠工资，和我一样地位的被拖欠2个月的工资，我的直接领导则被拖欠了3个月工资。被迫签着无奈的离职申请，工资也无期限还（合同写是年底还，结果还是唬人)。​ 2015年9月底，比较困难的是——到9月份的时候学校毕业两个月，其中在第一个月拿了工资2700，第二个月的工资拖到第三个月才发；恰逢毕业也支出了不少留给回忆；并且房租等问题也一并浇到身上，在北京找房东看西找对比才来到了目前的住处，而普遍的模式都是压一付三，一共加起来得给房东14400元，并且这个房子里面空无一物，床、桌椅、厨具等东西都得一一置办。从参加培训后，在京的生活一直都过得十分节俭，任何的多余支出都是对自己侵蚀加害，因为身上真的无多少余钱。回忆了下，貌似当时身上就2200左右吧，可想而知，第一面对不良公司的拖欠工资，第二面对生活消费、交通费用等每日最低30元，第三面对即将要交付的租金押金，所以按照提前计划合理消费安排是我得死守的唯一活路。自己一直不愿意向家里要资金，因为强烈的成长心和自尊心，觉得只要这一时间过去一切都还可以。不过也有另一个提前的命运供给是：我一年半前买了1000的基金，等到9月底的时候刚好到期，本息加起来1500，所以合理理财无意中帮助了现在的我；另外，我和几个小伙伴接的一个项目已经开发了两个月有余，在简单的界面和逻辑、网络请求完备的情况下我要求对方支付全工程的一般资金8000，也顺利到帐下了。和小伙伴们再各出一部分资金，事情也算勉强下来。也许前期的这些机遇都是为了结束后期的受苦受难，面对一毕业就展开这么多不顺人意的事情也算是狠狠扇了我的脑袋。这段时间内，多去了解自己所在领域的行业资讯、技术进修，每日学习是千万不能放弃的事情。我们在30岁前这期间内是创造不了多少财富的，我们30岁后的每一天创造的财富是我们现在的4~9倍（前提你已拥有这样的能力），唯有经历、知识和搭建出的关系网才是我们现在宝贵的财富，当然自身的身体锻炼也能为我们省下不少医药费；我的观点是在保留较为富足的资金（2~3万）作为应急情况下，尽量把剩下的钱拿来打造自己，提升自己在各方面的能力、体验各方面的社交活动、扩大自己的眼界，当然我现在还是独自一人时候的计划，并且家里也没有太多的负担。​ 2015年10月初，在解决完最近比较苦恼的事情后。又到了面临找工作的阶段，虽然上家公司不人道，不过我在里边算是经历了完整的工作流程，并且我感谢和我一同工作的同事，他教给了我很多互联网概念、编程核心的启发、自我约束行为、代码格式规范等。如果不是因为同事能够让我了解到这些我不在意、未知的事情（更重要的是我知道这个人懂的东西到达了一个我现在企及不到的地步，让我见到了大巫，有了相应的概念后我才能知道自己未来该努力的方向），公司拖欠工资开始我就可以离开了。在上家公司，和周围同事、领导都有不错的工作关系，所以他们也给我提供了下家公司内推的机会，也许是担惊受怕，我还是拒绝了他们。然后，樊同学此刻就又登场了。​ 樊同学，我们常称旭哥，为人比较圆润、待人接物方面情商比我高，不过在技术能力方面资质平平。他有幸进入一家做航天遥感、卫星地图的公司做开发工作，不过各方面原因进去3个月有余任何进展都没有。所以在我工资被拖欠开始就一直怂恿我离职，然后去到他们公司。直到我离职后才答应去他们公司看看， 公司坐落在奥林匹克森林公园旁的一个小公园里，整个公园周围比较人烟稀少没有什么饮食场所，所以公园内的一些公司集结起来请师傅在我们办公旁的地方开一家午餐供应餐厅，豪华的工作餐（四菜一汤外加糕点、水果~据说是65元的规格）。在工资方面虽然太低，低过我预期的正常工作工资，不过生活的压力还是让我屈服于这一阶段的隐忍，不过午餐的福利我还是相当满意的。​ 2015年10月底， 我入职了目前的公司“北京中天易观”。进入公司为了尽快把业务各方面的工作展开，我真的是尽职尽责担当了半个产品经理的责任和义务。第一个月，我们确定需求、规划功能、设计原型、设计数据库，然后写了一个月的技术文档资料（编码风格、模块划分、相应库的引用……）、以及开发的规划安排。我的直接领导是从部队下来的教授（称 龚博士），虽然我的每次谏言都被他肯定，但是现实就是肯定只是肯定，并没有相应的行动力。作为一个刚来不久的人员，并且也才大学刚毕业，一下子给他提出那么多的要求确实是我职场幼稚的表现，他也只是肯定了我的能力，但不一定表示信任我~~~晕死。随着工作的不断进展，原先忙于其它项目他的心腹可以回归到我所在的产品研发了。不得不骂句，工作了这么多年他心腹的能力就仅此而已，到底是我能力太强还是他能力过弱，处处对我建议和对产品的规划设计进行个人情绪的破坏，用着老式的工作方式来应对互联网开发，并且时时对我们的整个开发小组进行无脑的要求行为，实在是太过分了，为此和他的争执已经响彻了整个管理阶层。不过，这么底层的我已经不怕什么了(￣▽￣)”，我只想把产品做得尽善尽美。在这开发的时间里，虽然我知道旭哥能力达不到开发的水准，自己要承担很多活，不过为什么我直接承担了两个人的工作然后什么事情都是向我开炮？无论旭哥怎么辩言，他写的模块我基本都得重构一遍，代码风格也不按我的要求走，语言、生命周期都没一个明确的概念，心真的好累。于是基本上周周加班，天天晚归，我在做开发，他在旁边聊天、做其他无关的东西。不过，比较好的是自己掌控了这领域的100%设计开发流程主权，并且他能站在我这边就足够了（我怎么感觉，自己那么委屈）。​ 2016年10月初，小伙伴亮亮离职。之所以在这里记录亮亮的事件点是因为和后续发生的事件有关，在此我简略介绍下亮亮。初次认识亮亮，是在5月份的时候过来想和我们一起供租，亮亮是成哥、小军的同期开发培训同学。在成哥和小军的印象里：亮亮是个仗义之人， 有过很多次的两面插刀行为，性格爽朗。入驻这个大家庭后，亮亮也为家里的建设做出不少的贡献。当初寻找这片租地的时候，从北京西北五环到北京东南五环之间，亮亮也随我们四处奔波，选定住址之后家里的床、家具、厨具、水网煤等也少不了他的张罗。所以虽然和他还不是太熟，也觉得这小伙也还不错。在家，有时也能帮忙打扫卫生。之后家里的小伙伴也有陆陆续续的进出，也和他有不少关联。此刻觉得他还是有责任感的，有人缘。从他走了后，我就基本100%的干家务活了。​ 2016年1月初，小伙伴成哥成功离职第二次。之所以在这里记录亮亮的事件点是因为和后续发生的事件有关，在此我简略介绍下成哥。","categories":[{"name":"风雨日记","slug":"风雨日记","permalink":"http://yinzhen.tech/categories/风雨日记/"}],"tags":[{"name":"奋斗","slug":"奋斗","permalink":"http://yinzhen.tech/tags/奋斗/"}]},{"title":"都毕业了 秘密还是秘密","slug":"都毕业了-秘密还是秘密","date":"2015-06-27T18:46:58.000Z","updated":"2017-03-14T07:16:59.000Z","comments":true,"path":"2015/06/28/都毕业了-秘密还是秘密/","link":"","permalink":"http://yinzhen.tech/2015/06/28/都毕业了-秘密还是秘密/","excerpt":"","text":"​ 今晚夜是晴空，几日前的雾气散去。直至此刻，参加了许许多多的聚会，却始终没能和每一个见过的朋友说声“再见”。​ 小部员发来张信哲的歌曲《信仰》，原先没心没肺的我现在也五味杂陈，而且夜晚的夜总是显得那么孤寂。说感谢的话俗可泛滥，而不言真是我浑身上下的歉意、遗憾和浑蛋。很多心底事累堆放在了珍珠贝里，用自己的胆汁、泪水包裹着，虽然日复一日逐渐圆润，没有当初刺痛自己的那种感觉，却将包裹的事物越积越深，越养越大，一个房间只留下一个小小的地方给自己，像秘密那样，挥不去，打不开。​ 喜欢映衬不到眼瞳里存在的影子，​ 等待没有张开怀里微醺的温度，​ 靠近却又做出相反的步调，​ 秘密了，还是秘密。 ​ 毕业，知不知足：​ 把记录烦恼的课本埋葬；​ 清空躺了多年的被窝；​ 捐赠淘来的折叠桌；​ 捐赠磕碰的滑板；​ 捐赠捡来的自行车；​ 藏好送别你的礼物；​ 剪去刚及肩膀的小马扎；​ 把一柜子的衣物折叠，寄回遥远的家； ​ 要出发了， 那些我告别和来不及告别的人；​ 谢谢二楼西七号的炸酱面，三楼西的臊子面、朝鲜冷面和一号窗口的菜食，百来人的澡堂；​ 再见，我喜欢的你。","categories":[],"tags":[{"name":"青春","slug":"青春","permalink":"http://yinzhen.tech/tags/青春/"}]},{"title":"三月的霾","slug":"三月的霾","date":"2015-03-29T12:30:33.000Z","updated":"2017-03-14T07:17:26.000Z","comments":true,"path":"2015/03/29/三月的霾/","link":"","permalink":"http://yinzhen.tech/2015/03/29/三月的霾/","excerpt":"","text":"三月底的天，灰霾霾的。远方翻滚的黄尘在天空之际往下弥漫，午后的暖日成了片状的白光。歇斯底里地来到拥挤的教室格局，三月的霾是一个粗暴的强盗。​ 昨日去参加“开源大会”，在大会上无意一瞥发现许久不见的“猴子”和“胖子”，在讶异和欣喜之时走了过去，不得不说一些因缘是解不开的结。当然我不知道是什么样的巧合会在另外一个城市遇到相熟的故人，走在城市的任何地方都不会遇到一样的你们。大学的日子对我来说已经是半剩不剩，常常有人感慨大学的时光是多麽美好，让人留恋不舍。也许我的大学活得不够拼劲，青春的张力没有把我带向理想的高堂，梦想不过成了我拿来糊弄别人感觉的“单纯”。​ 每次一些事情失败之后，总想离开这已经熟悉再不能熟悉的环境，总以为离开重新开始才是最好的办法。烂摊子什么的自己不想要了，但是命运像根缚着身体的操线，我离不开控制我活动的这根线。于是，那些人和事都因为时间而合适地发生了。沉浸在自己的世界太久，是自己给自己造的牢笼。我从小就一直在寻找或制造有别与他人的奇特特点，总觉得独一无二的自己是世界上最珍贵的，也许由于这种想法造成了以后异样的行动和思维。当初熟不知道，一个独特的人在一个平衡的世界是那么格格不入，自己所想的世界只能自己一步步去造，许诺的理想越美好，要挣扎的世界也就越血淋漓。也不知是什么在召唤，最近在熟睡的时候总能感受着一些生命的流逝，感受万物的命运，感受别人从活到死的瞬息。人最无力的是千钧一发时抓不准时机，在力挽狂澜时手无缚鸡之力。受够了……三月的霾，是给自己的毒，最爱的是将自己沉醉在无奈的命运。​ 从天白到天黑，路程遥遥，我不能阻止白天变黑夜，我更不能阻止自己在凌晨两点前就睡着 ，而只能早点起床，在要过去的一天里汲取能够让自己能够千钧一发、力挽狂澜时该有的本领。所以一个人走着，一个人吃饭，一个人在练习，不要问我为什么又是一个人，因为一个人最容易做到自己想做的事。我除了幻想，也该活得像要奋斗的人一样。霾留给其他人的毒","categories":[{"name":"风雨日记","slug":"风雨日记","permalink":"http://yinzhen.tech/categories/风雨日记/"}],"tags":[{"name":"霾","slug":"霾","permalink":"http://yinzhen.tech/tags/霾/"},{"name":"迷茫","slug":"迷茫","permalink":"http://yinzhen.tech/tags/迷茫/"}]},{"title":"与考试无关的夜晚","slug":"与考试无关的夜晚","date":"2014-01-14T16:21:55.000Z","updated":"2017-03-14T07:16:37.000Z","comments":true,"path":"2014/01/15/与考试无关的夜晚/","link":"","permalink":"http://yinzhen.tech/2014/01/15/与考试无关的夜晚/","excerpt":"","text":"离别的风 憔悴的夜色光秃秃的树干 时光捻过的颜容走过的石板 没有留下的脚印 路过的水果铺 逐渐散去的灯光遇不上的人 奇怪的人上链的门口 没有人的值班室悄悄地 翻过篱笆 感冒的暖气 坚硬的绿花床落下的玻璃杯 破碎的祝福一些些的情绪 一些些的道理讲给自己听","categories":[{"name":"如果可以酿成一首诗","slug":"如果可以酿成一首诗","permalink":"http://yinzhen.tech/categories/如果可以酿成一首诗/"}],"tags":[{"name":"恋","slug":"恋","permalink":"http://yinzhen.tech/tags/恋/"}]},{"title":"风语消消黑人墓","slug":"风语消消黑人墓","date":"2013-06-10T09:27:42.000Z","updated":"2017-03-14T07:20:11.000Z","comments":true,"path":"2013/06/10/风语消消黑人墓/","link":"","permalink":"http://yinzhen.tech/2013/06/10/风语消消黑人墓/","excerpt":"","text":"一些音乐静静的像下着小雨那样小到撑伞也不是，不撑也不是就这样微妙着一阵阵阴云下的凉风今天是那么惬意地吹着音乐像小雨，在这风动的天气一直下着记录是种回忆，却来不及保存，消失不见 也许，忘怀 删掉如若是彻底的是否已安然再见如果是种可能，是否打个照面而过歌颂也已停止，心已坦荡，一种相识，不过半年美好的不美好忘掉忘不掉的走去没走过的 谢谢你 ，两季没闲过的日月","categories":[{"name":"如果可以酿成一首诗","slug":"如果可以酿成一首诗","permalink":"http://yinzhen.tech/categories/如果可以酿成一首诗/"}],"tags":[{"name":"寂寞","slug":"寂寞","permalink":"http://yinzhen.tech/tags/寂寞/"}]},{"title":"今年的大四一条街","slug":"今年的大四一条街","date":"2013-06-03T14:09:10.000Z","updated":"2017-03-14T07:22:58.000Z","comments":true,"path":"2013/06/03/今年的大四一条街/","link":"","permalink":"http://yinzhen.tech/2013/06/03/今年的大四一条街/","excerpt":"","text":"学校大四一条街卖着些书，生活品，和配件类物品。也许是有点商人的资质，就打算去瞎逛着，砍砍价，当做是种乐趣。于是~​ 昨天差点忽悠成功一哥们买个滑板陪我玩，今天我再次带上另外一人 ，打算买点专业书籍（学校订的书贵）类的，首家一帅哥，起价100元，我唠叨了大半天80底盘，我本着60元处理，帅哥委屈状 ：“你怎么不尊重一下市场规律，现在才摆摊没几天，你怎么能这样随随便便就砍价这么厉害，好歹也要过几天啊~（过几天这价就对不起我自己了）”。于是就作离开状 ~居然还真不肯往下掉价 （好吧，我就先去其他家逛逛）；​ 第二家一气质美女，起价130元（全新包括各种笔记和大四书籍），也唠叨了半天100元底盘，此刻见书不错本着80元处理的，再做离开状 ，唉~现在的学姐要求太高了，现在卖得那么贵到时候也得几毛钱论斤卖的份都有；​ 然后到了第三家我就说了，你看你隔壁那家帅哥卖给我80元我还嫌贵了，你们就不能往下降了么？ 然后学姐就说了：“我们都统一商量好了，一律卖130，你说的是隔壁那家么？（指了指）你看我都卖了好几套了，你看用我的书没错，又有笔记，书还很新，关键是我都有得奖学金，用了我的你也能一样的~（可是我能说之前那几家也是这么向我推销的么？）那我给你看看我的成绩单吧~”本着不甘心~，打算这几天都出来遛弯，看看有什么新的内容，转身呆在一旁思考状。那学姐就不讲究了，很不淡定地去到了隔壁摊那家帅哥店里，作教育状：“你怎么能这么不讲究呢？卖的书旧了点也就算了，转手几次也就算了，你还80元卖出去，有你这样的么！（学姐教育的是啊~ ）”接着：“我们不是都说好统一卖130元的么！（晕，这么回事啊）”你们这样也不尊重市场规律啊！而且是垄断价格的啊！好吧，我还是过几天再出来瞧瞧了 。​ 回想一下去年，路见一大妈走到一学姐前买蚊帐，问几元，学姐伸出了五个手指头！ 大妈果断往摊上扔下五毛钱飞快的跑了 ，留下凌乱的学姐。然后再发生什么有趣的事呢，后载吧。","categories":[{"name":"风雨日记","slug":"风雨日记","permalink":"http://yinzhen.tech/categories/风雨日记/"}],"tags":[]},{"title":"遥想蚊子当年","slug":"遥想蚊子当年","date":"2013-05-18T02:52:39.000Z","updated":"2017-03-14T07:30:25.000Z","comments":true,"path":"2013/05/18/遥想蚊子当年/","link":"","permalink":"http://yinzhen.tech/2013/05/18/遥想蚊子当年/","excerpt":"","text":"​ 最近老家那边貌似温度挺高的，各色昆虫貌似要开个全国协商会议。​ 回想当初我还在家时，蚊音袅袅，它们用特殊的节奏带领整个夜色进入一个高度兴奋的迪斯科，而且舞姿还真是多种多样： 有的像飞机一样缓慢滑翔，一般不发出声音，不过低空的很容易就被我给坠机了； 有的像个震荡的伤残酒鬼上下地飞，这种姿势给你带来的声音是爬到半山腰然后滚下来的“嘤（上声）~~嘤（下声）的交织循环，这时可以用扇子、书本等风力输出大的物体往它方向打过去，一般可以纠正它的轨迹使它趋于一个平缓的曲线，这时就可以用如来神掌了。不过也有的是心理素质不太好的，就会变得踉跄的，这时它就会找到一个地方歇歇脚，跟上它，看看去了哪里。 有的还像回旋的螺线，真怀疑是个杂技演员，不然就是小脑只剩下一半，发出的声音就和多普勒效应一样，应用的方法同二。 ​ 那些年，蚊子是相对健康地喝着饮料的，不像现在我们自己污染了自己，也要去迫害蚊兄； 那些年，我常常在两点睡觉，因为有了蚊兄的陪伴，我可以活络筋骨，不至于半夜无趣还去想些奇怪的数学问题，直接就是生物+物理+化学的综合复习，还有体育锻炼； 那些年，是蚊兄教会了我，一个人的奋斗是很艰苦滴！所以你得有效地解决一些生活问题，像是该不该挂个蚊帐给自己一堵墙保护自己，该不该用”雷达或是菊花“等奇效去伤害蚊兄也伤害自己，还有家里养的植物要选用什么样的； 那些年，蚊兄让我知道了被吻的感觉，我只能说，单位面积造成伤害和欲望有关。当我觉察出感觉时，这丫的饿昏了，一点不懂温柔，所以对待不温柔的人只好和它say good bye了。 其实蚊兄，我见过的有四种： 一种个大无花纹，它是憨厚老实型的； 一种是个小无花纹，它是有点温柔的； 一种是个小带花纹的，不但花心而且它是一点都不温柔的，事后那个小包很久消散，也奇痒； 还有一种是公蚊子，它是绿色的，一直垂涎我家植物好久了。 ​ 温度有点高了，风也很歇斯底里地吹着， 尽管安装了窗网，不过貌似阻隔不了蚊子这种激进份子。所以，到晚上，一个人睡的时候还真是苦不堪言，好在大学让我体验了一把”我为人人，人人为我“的光荣传统。 呵呵，写得有点长了，还有什么方法呵护蚊兄的请补充吧。ps：早上一定要吃早餐啊~，饿昏了，神志不清的。","categories":[],"tags":[{"name":"蚊子","slug":"蚊子","permalink":"http://yinzhen.tech/tags/蚊子/"}]},{"title":"远古","slug":"远古","date":"2011-06-26T15:25:51.000Z","updated":"2017-03-14T07:33:32.000Z","comments":true,"path":"2011/06/26/远古/","link":"","permalink":"http://yinzhen.tech/2011/06/26/远古/","excerpt":"","text":"远古的时候， 是否曾经有过我，相约一物 一起到老 一起死去 远古的时候， 是否存在过我，也是否存在过你 相约永世 寻找彼此 相见一次 也许生生世世，世世生生 我们都没再次相遇 转入轮回 你我是否还会记得寻找彼此？","categories":[{"name":"如果可以酿成一首诗","slug":"如果可以酿成一首诗","permalink":"http://yinzhen.tech/categories/如果可以酿成一首诗/"}],"tags":[{"name":"恋","slug":"恋","permalink":"http://yinzhen.tech/tags/恋/"}]},{"title":"蓬莱","slug":"蓬莱","date":"2009-05-28T10:08:04.000Z","updated":"2017-03-14T07:36:41.000Z","comments":true,"path":"2009/05/28/蓬莱/","link":"","permalink":"http://yinzhen.tech/2009/05/28/蓬莱/","excerpt":"","text":"海滩的那一边，一叶扁舟在荡漾星光点烁，风平浪静又一轮月亮翘起了夜的眉梢 海滩的那一边，一阵铃声在飘舞没有了世人的喧嚣，没有了尘世的火燥一阵风吹起了雾帘从此再见了我的学校，班级，分数 像梦一般，不曾有过，又曾相识地—-我的小岛远离，远离……","categories":[{"name":"如果可以酿成一首诗","slug":"如果可以酿成一首诗","permalink":"http://yinzhen.tech/categories/如果可以酿成一首诗/"}],"tags":[{"name":"逃离","slug":"逃离","permalink":"http://yinzhen.tech/tags/逃离/"}]},{"title":"朦胧","slug":"朦胧","date":"2009-01-17T16:20:24.000Z","updated":"2017-03-14T07:38:52.000Z","comments":true,"path":"2009/01/18/朦胧/","link":"","permalink":"http://yinzhen.tech/2009/01/18/朦胧/","excerpt":"","text":"如果是你，它会飞起来， 像在有雾的微风中轻轻地摆动，摇摆 如果是风，他会等待， 在一个优美的山谷里轻轻把你托起，照顾 没有雾的季节，世界却变得如此朦胧 像月光在榆荫下的那潭湖水中翘起轻微的面容 我是你，在月儿的小角上垂下真实的悲伤 还会等待 还会努力 ————-回家","categories":[{"name":"如果可以酿成一首诗","slug":"如果可以酿成一首诗","permalink":"http://yinzhen.tech/categories/如果可以酿成一首诗/"}],"tags":[{"name":"恋","slug":"恋","permalink":"http://yinzhen.tech/tags/恋/"}]}]}